import pygame
from pygame.draw import *
pygame.init()

#Для удобства сокрасим написание слова
p = pygame
pi = 3.14
#Размер окна
X, Y = 800, 1000

#Созданное окно с названием "screen" на нём мы и будем рисовать
screen = p.display.set_mode((X,Y))
p.display.set_caption("ЧТО-ТО ГДЕ-ТО")
rect(screen, (47,79,79), (0, 0, X, Y)) #Закраска основного фона в болотно зелёный

screen2 = screen.convert_alpha( )#ХОЛСТ ДЛЯ РИСОВАНИЯ ПРАЗРАЧНЫХ ФИГУР
screen2.fill([0, 0, 0, 0])


#Палитра используемых цветов, с индексами яркости где 1 -самый светлый, 5 - самый тёмный

GRAY1 = (240, 255, 255)
GRAY2 = (211, 211, 211)
GRAY3 = (169, 169, 169)
GRAY4 = (112,128,144)
GRAY5 = (105,105,105)

GREEN1 = (143,188,143)
GREEN2 = (95,158,160)

BLACK = (0,0,0)
WHITE = (255,255,255)

BLUE = (0,255,255)
BLUE5 = (25, 25, 112)

BROWN = (139,69,19)
RED = (255, 69, 0)

# С ЭТОГО МОМЕНТА НАЧИНАЕТСЯ РИСОВАНИЕ----------------------------------------------------------


#Оформим небо и то где будет ехать машина
rect(screen, GRAY4, (0, 0, X, 580))#небо
line(screen, WHITE, (0, 580), (X,580), 3) #белая полоса между небом и землёй
rect(screen, GRAY5, (0, 800, X, Y))# Асфальт


# Градостроение (Ширина дома 180, высота 600 +-)
rect(screen, GRAY3, (20, 0, 180, 600))
rect(screen, GREEN1, (230, 0, 180, 620))
rect(screen, GRAY1, (600, 0, 180, 600))
rect(screen, GRAY2, (150, 80, 180, 600))
rect(screen, GREEN2, (500, 110, 180, 600))

# Конструируем Rolls-Royse(машину)


a,s,d,f = 310, 814, 300, 110                       #
while a!=340:                                      #
    arc(screen, BROWN, (a, s, d, f), 2, 3, 20)     #
    a += 0.5                                         # Я не придумал как иначе сделать гладкий скос крыши,и не думать с закраской внутренней части
    s += 0.5                                        #
    d -= 0.5                                        #
    f -= 0.5                                         #

circle(screen, BLACK, (335, 903), 30)     #Заднее колесо
circle(screen, WHITE, (335, 903), 27, 5)  #

polygon(screen, BROWN, [[250,915], [260,868], [263,865], [320,860], [395,818], [470,818],  #
                        [530,860], [630,865], [645,870], [645,913], [642,915]])            #корпус

polygon(screen, (240, 230, 140), [[360,857], [395,828], [435,828], [435,857]])#заднее окно
polygon(screen, BLACK, [[360,857], [395,828], [435,828], [435,857]], 3)
polygon(screen, (240, 230, 140), [[440,857], [440,828], [472,828], [516,857]])#переднее окно
polygon(screen, BLACK, [[440,857], [440,828], [472,828], [516,857]], 3)
polygon(screen, RED, [[260,890], [264,874], [267,872], [270,872], [270,890]])#Задняя фара
polygon(screen, (240, 230, 140), [[634,879], [634,870], [639,870], [642,879]])# Передняя фара
polygon(screen, BLACK, [[634,879], [634,870], [639,870], [642,879]],2)

line(screen, BLACK, (634,870), (274,872),2)

aaline(screen, BLACK, (360,857), (348,872))#
aaline(screen, BLACK, (348,872), (348,910))#Линии задней двери
aaline(screen, BLACK, (348,910), (350,915))#
aaline(screen, BLACK, (435,828), (435,915))#

aaline(screen, BLACK, (440,828), (440,915))#
aaline(screen, BLACK, (516,857), (524,863))#Линии передней двери
aaline(screen, BLACK, (524,863), (524,910))#
aaline(screen, BLACK, (524,910), (520,915))#

circle(screen, BLACK, (584, 903), 30)      #переднее колесо
circle(screen, WHITE, (584, 903), 27, 5)   #
circle(screen, GRAY3, (584, 903), 13)      #


#Прозрачные элементы



polygon(screen2, (200, 255, 255, 64), [[634,873], [X,865], [X,920]])#Свет фар











#---------------------------------------------------------------------------------------------
#Всё что дальше нам не надо

screen.blit(screen2, (0,0))# Позволяет рисовать поерх холста screen прозрачными фигурами
p.display.update()
while True:
    for event in p.event.get():
        if event.type == p.QUIT:
            pygame.quit()
